==================
Standard cast
==================

SELECT CAST(1 AS TEXT);

---

(program
 (statement
  (select
    (keyword_select)
    (select_expression
      (cast (identifier) (literal) (keyword_as) (keyword_text))))))

==================
Aliased
==================

SELECT CAST(1 AS TEXT) AS fieldname;

---

(program
 (statement
  (select
    (keyword_select)
    (select_expression
      (cast (identifier) (literal) (keyword_as) (keyword_text))
      (keyword_as)
      (identifier)))))

==================
Postgres shorthand
==================

SELECT 1::TEXT;

---

(program
 (statement
  (select
    (keyword_select)
    (select_expression
      (cast (literal) (keyword_text))))))

==================
Multiple casts
==================

SELECT
  CAST ('100' AS INTEGER),
  '100'::INTEGER,
  '01-OCT-2015'::DATE;

---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (cast
     name: (identifier)
     parameter: (literal)
     (keyword_as)
     (keyword_int))
    (cast
     (literal)
     (keyword_int))
    (cast
     (literal)
     (keyword_date))))))
