==================
Select 1
==================

SELECT 1;

---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (literal)))))

==================
Simple select
==================

SELECT * FROM my_table;

---

(program
 (statement
  (select
   (keyword_select)
   (select_expression))
  (from
   (keyword_from)
   (table_expression name: (identifier)))))

==================
Simple select with fields
==================

SELECT id, name FROM my_table;

---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (field name: (identifier))
    (field name: (identifier))))
  (from
   (keyword_from)
   (table_expression name: (identifier)))))

==================
Simple select with fields field table alias
==================

SELECT m.id, m.name
FROM my_table m;

---

(program
  (statement
    (select
     (keyword_select)
     (select_expression
      (field 
       table_alias: (identifier)
       name: (identifier))
      (field 
       table_alias: (identifier)
       name: (identifier))))
    (from
     (keyword_from)
     (table_expression
      name: (identifier)
      table_alias: (identifier)))))

==================
Simple select with where
==================

SELECT id
FROM my_table
WHERE id = 4;

---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (field 
     name: (identifier))))
  (from
   (keyword_from)
   (table_expression
    name: (identifier))
   (where
    (keyword_where)
    (where_expression
     (predicate
      left: (field name: (identifier))
      right: (literal)))))))

==================
Simple select with IN
==================

SELECT id
FROM my_table
WHERE id IN(1,2);

---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (field 
     name: (identifier))))
  (from
   (keyword_from)
   (table_expression
    name: (identifier))
   (where
    (keyword_where)
    (where_expression
     (predicate
      left: (field name: (identifier))
      operator: (keyword_in)
      right: (list (literal) (literal))))))))

==================
Simple select with order by
==================

SELECT id
FROM my_table
WHERE id > 4
ORDER BY id DESC;

---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (field 
     name: (identifier))))
  (from
   (keyword_from)
   (table_expression
    name: (identifier))
   (where
    (keyword_where)
    (where_expression
     (predicate
      left: (field name: (identifier))
      right: (literal))))
   (order_by
    (keyword_order_by)
    (order_expression
     (field name: (identifier))
     (direction (keyword_desc)))))))

==================
Simple select with limit
==================

SELECT id
FROM my_table
LIMIT 5;

---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (field 
     name: (identifier))))
  (from
   (keyword_from)
   (table_expression
    name: (identifier))
   (limit
    (keyword_limit)
    (literal)))))

==================
Simple select with offset
==================

SELECT id
FROM my_table
LIMIT 5
OFFSET 40;

---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (field 
     name: (identifier))))
  (from
   (keyword_from)
   (table_expression
    name: (identifier))
   (limit
    (keyword_limit)
    (literal)
    (offset
     (keyword_offset)
     (literal))))))

==================
Functions
==================

SELECT DISTINCT(id)
FROM my_table;
---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (function_call
     name: (function_name (identifier))
     parameter: (field name: (identifier)))))
  (from
   (keyword_from)
   (table_expression
    name: (identifier)))))

==================
Functions MAX
==================

SELECT MAX(id)
FROM my_table;
---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (function_call
     name: (function_name (identifier))
     parameter: (field name: (identifier)))))
  (from
   (keyword_from)
   (table_expression
    name: (identifier)))))

==================
Functions in functions
==================

SELECT COUNT(DISTINCT(id))
FROM my_table;
---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (function_call
     name: (function_name (identifier))
     parameter: 
     (function_call
      name: (function_name (identifier))
      parameter: (field name: (identifier))))))
  (from
   (keyword_from)
   (table_expression
    name: (identifier)))))

==================
Group by
==================

SELECT other_id, COUNT(name)
FROM my_table
GROUP BY other_id
HAVING other_id > 10;
---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (field name: (identifier))
    (function_call
     name: (function_name (identifier))
     parameter: (field name: (identifier)))))
  (from
   (keyword_from)
   (table_expression
    name: (identifier))
   (group_by
    (keyword_group_by)
    (identifier)
    (keyword_having)
    (predicate
     left: (field name: (identifier))
     right: (literal))))))

==================
Joins
==================

SELECT a.id, b.id
FROM my_table a
JOIN my_other_table b
ON a.id = b.a_id
WHERE b.c_id = 4;

---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (field 
     table_alias: (identifier)
     name: (identifier))
    (field 
     table_alias: (identifier)
     name: (identifier))))
  (from
   (keyword_from)
   (table_expression
    name: (identifier)
    table_alias: (identifier))
   (join
    (keyword_join)
    (table_expression
     name: (identifier)
     table_alias: (identifier))
    (keyword_on)
    (predicate
     left: (field
      table_alias: (identifier)
      name: (identifier))
     right: (field
      table_alias: (identifier)
      name: (identifier))))
   (where
    (keyword_where)
    (where_expression
     (predicate
      left: (field
       table_alias: (identifier)
       name: (identifier))
      right: (literal)))))))

==================
Joins with hint
==================

SELECT a.id, b.id
FROM my_table a
JOIN my_other_table b USE INDEX FOR JOIN (idx_a)
ON a.id = b.a_id;

---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (field 
     table_alias: (identifier)
     name: (identifier))
    (field 
     table_alias: (identifier)
     name: (identifier))))
  (from
   (keyword_from)
   (table_expression
    name: (identifier)
    table_alias: (identifier))
   (join
    (keyword_join)
    (table_expression
     name: (identifier)
     table_alias: (identifier))
    (index_hint
     (keyword_use)
     (keyword_index)
     (keyword_for)
     (keyword_join)
     index_name: (identifier))
    (keyword_on)
    (predicate
     left: (field
      table_alias: (identifier)
      name: (identifier))
     right: (field
      table_alias: (identifier)
      name: (identifier)))))))

==================
Multiple joins
==================

SELECT a.id, b.id, c.id
FROM my_table a
JOIN my_other_table b
ON a.id = b.a_id
JOIN table_three c
ON a.id = c.a_id;

---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (field 
     table_alias: (identifier)
     name: (identifier))
    (field 
     table_alias: (identifier)
     name: (identifier))
    (field 
     table_alias: (identifier)
     name: (identifier))))
  (from
   (keyword_from)
   (table_expression
    name: (identifier)
    table_alias: (identifier))
   (join
    (keyword_join)
    (table_expression
     name: (identifier)
     table_alias: (identifier))
    (keyword_on)
    (predicate
     left: (field
      table_alias: (identifier)
      name: (identifier))
     right: (field
      table_alias: (identifier)
      name: (identifier))))
   (join
    (keyword_join)
    (table_expression
     name: (identifier)
     table_alias: (identifier))
    (keyword_on)
    (predicate
     left: (field
      table_alias: (identifier)
      name: (identifier))
     right: (field
      table_alias: (identifier)
      name: (identifier)))))))

==================
Complex Predicates
==================

SELECT id
FROM my_table m
WHERE m.id > 4 AND id < 3;

---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (field
     name: (identifier))))
  (from
   (keyword_from)
   (table_expression
    name: (identifier)
    table_alias: (identifier))
   (where
    (keyword_where)
    (where_expression
     (predicate
      left: 
       (predicate
        left:
          (field
           table_alias: (identifier)
           name: (identifier))
        right: (literal))
       operator: (keyword_and)
       right: 
        (predicate
          left: (field name: (identifier))
          right: (literal))))))))

==================
Complex Predicates with order by
==================

SELECT title, id
FROM my_table m
WHERE m.id > 4 AND id < 3
ORDER BY m.title, id ASC;

---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (field name: (identifier))
    (field name: (identifier))))
  (from
   (keyword_from)
   (table_expression
    name: (identifier)
    table_alias: (identifier))
   (where
    (keyword_where)
    (where_expression
     (predicate
      left: 
       (predicate
        left:
          (field
           table_alias: (identifier)
           name: (identifier))
        right: (literal))
       operator: (keyword_and)
       right: 
        (predicate
          left: (field name: (identifier))
          right: (literal)))))
   (order_by
    (keyword_order_by)
    (order_expression
     (field table_alias: (identifier) name: (identifier))
     (field name: (identifier))
     (direction (keyword_asc)))))))



==================
Index hints
==================

SELECT id
FROM my_table FORCE INDEX (long_index_identifier)
LIMIT 1;

---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (field
     name: (identifier))))
  (from
   (keyword_from)
   (table_expression
    name: (identifier))
   (index_hint
    (keyword_force)
    (keyword_index)
    index_name: (identifier))
   (limit
    (keyword_limit)
    (literal)))))

==================
Index hints (use)
==================

SELECT id
FROM my_table USE INDEX (long_index_identifier)
LIMIT 1;

---

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (field
     name: (identifier))))
  (from
   (keyword_from)
   (table_expression
    name: (identifier))
   (index_hint
    (keyword_use)
    (keyword_index)
    index_name: (identifier))
   (limit
    (keyword_limit)
    (literal)))))



==================
Altogether now
==================

SELECT c._id, c.p_id
  FROM c_table c
FORCE INDEX (idx_c_on_s_id_and_p_id_and_c_id)
JOIN cp_table cp
  ON cp.c_id = c.id
  AND cp.s_id = c.s_id
JOIN my_table USE INDEX FOR JOIN (idx_my_table_on_s_id_and_id)
  ON c.c_id = my_table.id
  AND c.s_id = my_table.s_id
WHERE c.s_id = 1239
  AND c.p_id in (1)
  AND cp.ch_id = 6
  AND cp.is_published = TRUE
ORDER BY my_table.title, my_table.id;

----

(program
 (statement
  (select
   (keyword_select)
   (select_expression
    (field table_alias: (identifier) name: (identifier))
    (field table_alias: (identifier) name: (identifier))))
  (from
   (keyword_from)
   (table_expression
    name: (identifier)
    table_alias: (identifier))
   (index_hint
    (keyword_force)
    (keyword_index)
    index_name: (identifier))
   (join
    (keyword_join)
    (table_expression name: (identifier) table_alias: (identifier))
    (keyword_on)
    (predicate
     left: 
     (predicate 
      left: (field table_alias: (identifier) name: (identifier))
      right: (field table_alias: (identifier) name: (identifier)))
     operator: (keyword_and)
     right: 
     (predicate 
      left: (field table_alias: (identifier) name: (identifier))
      right: (field table_alias: (identifier) name: (identifier)))))
  (join
   (keyword_join)
   (table_expression name: (identifier))
   (index_hint
    (keyword_use)
    (keyword_index)
    (keyword_for)
    (keyword_join)
    index_name: (identifier))
   (keyword_on)
   (predicate 
    left: 
    (predicate
     left: (field table_alias: (identifier) name: (identifier))
     right: (field table_alias: (identifier) name: (identifier)))
    operator: (keyword_and)
    right: 
    (predicate 
     left: (field table_alias: (identifier) name: (identifier))
     right: (field table_alias: (identifier) name: (identifier)))))
  (where
   (keyword_where)
   (where_expression
    (predicate
     left: 
     (predicate
      left:
      (predicate
       left:
       (predicate
        left:
        (field
         table_alias: (identifier)
         name: (identifier))
        right: (literal))
       operator: (keyword_and)
       right: 
       (predicate
        left: (field table_alias: (identifier) name: (identifier))
        operator: (keyword_in)
        right: (list (literal))))
      operator: (keyword_and)
      right: 
      (predicate
       left: (field table_alias: (identifier) name: (identifier))
       right: (literal)))
     operator: (keyword_and)
     right: 
     (predicate
      left: (field table_alias: (identifier) name: (identifier))
      right: (field name: (identifier))))))
  (order_by
   (keyword_order_by)
   (order_expression
    (field table_alias: (identifier) name: (identifier))
    (field table_alias: (identifier) name: (identifier)))))))
